[
  {
    "date": "2026-01-31",
    "title": "リリースしました！",
    "content": [
      "『紫電一閃』リリース！",
      "・全12ステージ実装",
      "・オンラインラウンジ機能追加",
      "・称号システム実装"
    ]
  },
  {
    "date": "2026-02-05",
    "title": "剣獣戦を実装しました！",
    "content": [
      "・更新履歴表示機能を追加しました。",
      "・ラウンジに剣獣戦を実装しました。",
      "・剣獣戦のボス撃破時に、それぞれ固有の称号が獲得できます。",
      "・Stage2のボス戦の難易度を下げました。"
    ]
  },
  {
    "date": "2026-02-06",
    "title": "剣獣戦の修正",
    "content": [
      "・登場する剣獣を曜日に対応するようにしました。"
    ]
  },
  {
    "date": "2026-02-07",
    "title": "ボスステージの修正",
    "content": [
      "・ボス戦で敗北した時にスキルを獲得できなくなっていた不具合を修正しました。",
      "・スマホ版でボス戦闘時の戦闘ログを見やすくしました。"
    ]
  },
  {
    "date": "2026-02-09",
    "title": "ボス戦のログをテキスト表示できるようになりました、他",
    "content": [
      "・ボス戦のログをテキスト表示に切り替えるボタンを追加しました。",
      "・【連撃】が発動してもラウンド終了時に破壊されない不具合を修正しました。",
      "・初回でRULEボタンが押せないようにしました。（大丈夫！まずはNEW GAME！）",
      "・勝利時だけでなく、前回選択したスキル構成が「戦いの記憶」として残るように改善しました。",
      "・スキルにマウスホバーした後、説明文のリンクを表示する時の操作性を改善しました。",
      "・ルール説明の修正を行いました。（迎撃スキルの説明・【裏霞】、狼狽、スタンの説明）"
    ]
  },
  {
    "date": "2026-02-10",
    "title": "【連撃】の修正打ち消し",
    "content": [
      "・【連撃】のリミテッドをなくしました。コンボ性が高いため強いままの方が良いと判断しました。",
      "・アップデート時にキャッシュクリアしないと反映されない不具合を修正しました。"
    ]
  },
  {
    "date": "2026-02-11",
    "title": "電影戦を実装しました！",
    "content": [
      "・マイページで、「電影」を作って投稿できるようになりました。あなただけのボスを作ろう！",
      "　スキルを8個まで編成して、他のプレイヤーに挑戦してもらうことができます。",
      "　投稿した電影は、ラウンジ画面にランダムで3人までピックアップされます。",
      "　※電影の投稿前に、必ずガイドラインを一読してください。",
      "・自分のプロフィールを見るボタンをラウンジに追加しました。",
      "・今日の剣獣が表示されないことがある不具合を修正しました。"
    ]
  },
  {
    "date": "2026-02-12",
    "title": "UI関連の修正",
    "content": [
      "・電影Pick up!に更新ボタンを追加しました。",
      "・参加者画面に電影を持っているか表示する項目を追加しました。",
      "・電影への❤(いいね)をON/OFFできるようにしました。",
      "・スマホ版の電影戦でメイン背景が消えない不具合を修正しました。",
      "・ブラウザを更新しないと電影へのクリア人数、挑戦回数、❤(いいね)が更新されない不具合を修正しました。"
    ]
  },
  {
    "date": "2026-02-13",
    "title": "BATTLS STATSの実装・UI関連の修正",
    "content": [
      "・タイトル画面にBATTLE STATSボタンを実装しました！各ステージのBOSSを撃破した人数を見ることができます！",
      "・ボス戦のアニメーションログが戦闘開始まで戻ってしまう不具合を修正しました。",
      "・ボス戦に敗北すると再挑戦ボタンが表示されないことがある不具合を修正しました。",
      "・スマホ版でアニメーションログが下に伸びて画面がカタつく問題を修正しました。",
      "・iPhone版(iOS Safari)でボス戦のアニメーションが途中で止まる不具合を修正しました。"
    ]
  },
  {
    "date": "2026-02-14",
    "title": "戦闘処理の修正",
    "content": [
      "・両者の所持スキルが全て破壊されている場合、攻撃権を持っているキャラクターの勝利となっていた不具合を修正しました。(ルールどおり敗北となります)",
      "・電影の名前に正規表現上の特殊文字(カッコなど)が含まれている場合、アニメーションログで体力ゲージが減らない不具合を修正しました。"
    ]
  }
]
